package main

import (
    "fmt"
    "os"
)

func hasKey(m map[string]string, target string) bool {
    _, ok := m[target]
    if ok {
        return true
    } else {
        return false
    }
}

func main() {
    var KANA_MAP = map[string]string{
        "っ":"ッ",
        "ぁ":"ァ", "あ":"ア", "ぃ":"ィ", "い":"イ", "ぅ":"ゥ", "う":"ウ", "ぇ":"ェ", "え":"エ", "ぉ":"ォ", "お":"オ",
        "か":"カ", "が":"ガ", "き":"キ", "ぎ":"ギ", "く":"ク", "ぐ":"グ", "け":"ケ", "げ":"ゲ", "こ":"コ", "ご":"ゴ",
        "さ":"サ", "ざ":"ザ", "し":"シ", "じ":"ジ", "す":"ス", "ず":"ズ", "せ":"セ", "ぜ":"ゼ", "そ":"ソ", "ぞ":"ゾ",
        "た":"タ", "だ":"ダ", "ち":"チ", "ぢ":"ヂ", "つ":"ツ", "づ":"ヅ", "て":"テ", "で":"デ", "と":"ト", "ど":"ド",
        "な":"ナ", "に":"ニ", "ぬ":"ヌ", "ね":"ネ", "の":"ノ",
        "は":"ハ", "ば":"バ", "ぱ":"パ", "ひ":"ヒ", "び":"ビ", "ぴ":"ピ", "ふ":"フ", "ぶ":"ブ", "ぷ":"プ", "へ":"ヘ", "べ":"ベ", "ぺ":"ペ", "ほ":"ホ", "ぼ":"ボ", "ぽ":"ポ",
        "ま":"マ", "み":"ミ", "む":"ム", "め":"メ", "も":"モ",
        "ゃ":"ャ", "や":"ヤ", "ゅ":"ュ", "ゆ":"ユ", "ょ":"ョ", "よ":"ヨ",
        "ら":"ラ", "り":"リ", "る":"ル", "れ":"レ", "ろ":"ロ",
        "ゎ":"ヮ", "わ":"ワ", "ゐ":"ヰ", "ゑ":"ヱ", "を":"ヲ", "ん":"ン", "ゔ":"ヴ", "ゕ":"ヵ", "ゖ":"ヶ",
    }

    katakana := os.Args[1]
    var kana_buf string

    for _, ch := range katakana {
        if hasKey(KANA_MAP, string(ch)) {
            kana_buf = kana_buf + KANA_MAP[string(ch)]
        }
    }

    fmt.Println(kana_buf)
}
